nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/eiq_examples/mpp/src/cm33_core1/pin_mux.c
/*
 * Copyright 2024-2026 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v14.0
processor: MIMXRT798S
package_id: MIMXRT798SGVKB
mcu_data: ksdk2_0
processor_version: 0.0.0
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_iopctl.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures UART debug console pins for CM33 core1 (LP_FLEXCOMM19).
 *                 PIO8_14 = FC19_RXD, PIO8_15 = FC19_TXD
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    RESET_ClearPeripheralReset(kIOPCTL1_RST_SHIFT_RSTn);

    /* PIO8_14: FC19_RXD_SDA_MOSI_DATA */
    const uint32_t port8_pin14_config = (IOPCTL_PIO_FUNC1 |
                                         IOPCTL_PIO_PUPD_DI |
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         IOPCTL_PIO_INBUF_EN |
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |
                                         IOPCTL_PIO_DRIVE_100OHM |
                                         IOPCTL_PIO_ANAMUX_DI |
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         IOPCTL_PIO_INV_DI);
    IOPCTL_PinMuxSet(IOPCTL1, 8U, 14U, port8_pin14_config);

    /* PIO8_15: FC19_TXD_SCL_MISO_WS */
    const uint32_t port8_pin15_config = (IOPCTL_PIO_FUNC1 |
                                         IOPCTL_PIO_PUPD_DI |
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         IOPCTL_PIO_INBUF_DI |
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |
                                         IOPCTL_PIO_DRIVE_100OHM |
                                         IOPCTL_PIO_ANAMUX_DI |
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         IOPCTL_PIO_INV_DI);
    IOPCTL_PinMuxSet(IOPCTL1, 8U, 15U, port8_pin15_config);
}
